[{"model": "rocks.rock", "pk": 1, "fields": {"name": "Luna", "description": "Luna is the epitome of elegance, with her velvety alabaster surface gleaming in soft, diffused light. She is a connoisseur of the finer things in life and prefers her environment to reflect her refined taste. Luna thrives in minimalistic, serene settings where she can be admired for her quiet sophistication. She's not one to warm up to everyone, choosing instead to bond deeply with a single caretaker who understands her subtle needs and respects her boundaries. When she doesn't feel appreciated, she's quick to retreat into her aloof demeanor, but when treated with the reverence she demands, Luna's presence radiates calm and grace.", "short_description": "Luna is an elegant, fussy rock who expects nothing but the best. She thrives in a quiet environment where she can be the centrepiece of attention. Luna bonds deeply with one caretaker, ignoring others with a dignified tilt of her polished surface.", "user_notes": "", "is_owned": true, "owner": null, "material": "Alabaster", "texture": "Smooth", "personality": "Proud, confident, reserved", "shape": "Rounded", "price": "19.99", "accessories": null, "image": "rock-alabaster.webp", "image_url": null}}, {"model": "rocks.rock", "pk": 2, "fields": {"name": "Grumble", "description": "Grumble's rough exterior may give off an intimidating first impression, but beneath his rugged facade lies a steadfast companion with a heart of gold. He's the kind of rock who thrives in nature, basking in the sun or nestled in the shade of a garden. His textured basalt surface feels solid and grounding to the touch, mirroring his reliable and dependable nature. While he's not one for small talk, Grumble has a comforting presence and makes an excellent listener. He's happiest when he's out adventuring with his adopter, though he's equally content resting on a shelf where he can quietly observe the world.", "short_description": "Grumble has a rugged exterior and a heart of gold. Though he might seem gruff at first, he loves a good chat (or at least listening to one) and enjoys being outdoors. He's a low-maintenance, steady companion who keeps you grounded.", "user_notes": "", "is_owned": false, "owner": null, "material": "Basalt", "texture": "Rough", "personality": "Kind, frank, relaxed", "shape": "Uneven", "price": "11.99", "accessories": null, "image": "rock-basalt.png", "image_url": null}}, {"model": "rocks.rock", "pk": 3, "fields": {"name": "Crystal", "description": "Crystal is the sage of the rock world, with her translucent beauty symbolizing clarity and harmony. Her crystal-clear surface refracts light in mesmerizing ways, filling any room with a serene glow. Crystal has a calming presence that makes her the ideal companion for someone who values mindfulness and balance. She thrives in tranquil spaces, like a quiet meditation corner or a desk where she can help her adopter focus and find inner peace. Though she's delicate in appearance, Crystal is surprisingly resilient and steadfast, always there to ground you in times of need. She doesn't demand attention but quietly amplifies positive energy wherever she's placed, making her the perfect rock for those who appreciate subtle beauty and profound wisdom.", "short_description": "Crystal is a serene, wise rock who radiates calm and clarity. With her crystal-clear appearance, she thrives in peaceful, well-lit spaces. She loves to help her caretakers find balance and focus, always offering a soothing presence in moments of chaos.", "user_notes": "", "is_owned": false, "owner": null, "material": "Clear Quartz", "texture": "Sharp", "personality": "Calm, secure, bright", "shape": "Pointy", "price": "12.99", "accessories": null, "image": "rock-quartz.png", "image_url": null}}, {"model": "rocks.rock", "pk": 4, "fields": {"name": "Echo", "description": "Echo is a rock with an air of mystery and intrigue. Her sleek, jet-black obsidian surface glints sharply in the light, hinting at her enigmatic nature. She prefers the quiet of a dimly lit room, where she can soak up the atmosphere and add a touch of drama to her surroundings. Echo doesn't open up easily but forms a deep connection with those who appreciate her introspective, aloof personality. She's a bit of a diva'sharp-edged and demanding care'but her loyalty to those who handle her with care is unparalleled.", "short_description": "Mysterious and aloof, Echo has a flair for the dramatic. She's perfect for someone who enjoys quiet evenings with a companion who won't spill secrets. Handle her carefully'she's sharp in every sense of the word.", "user_notes": "", "is_owned": false, "owner": null, "material": "Obsidian", "texture": "Sharp", "personality": "Aloof, mysterious, dramatic", "shape": "Rounded", "price": "12.99", "accessories": null, "image": "rock-obsidian.webp", "image_url": null}}, {"model": "rocks.rock", "pk": 5, "fields": {"name": "Pebbles", "description": "Pebbles is the epitome of laid-back charm. Her smooth, cool surface is a testament to years of gentle tumbling in river currents, shaping her into a rock that exudes calm and warmth. She thrives in family settings, adapting easily to the hustle and bustle of everyday life. She's playful with children, welcoming to pets, and a perfect companion for anyone who loves the great outdoors. Her favorite pastime is basking in a sunny window or being taken on little adventures. Easygoing and affectionate, Pebbles brings a sense of peace wherever she goes.", "short_description": "Pebbles is a laid-back, go-with-the-flow type who thrives in a family environment. She's great with kids, pets, and other rocks. Her favorite pastime is sunbathing on a windowsill.", "user_notes": "", "is_owned": false, "owner": null, "material": "River rock", "texture": "Smooth", "personality": "Laid-back, playful, gentle", "shape": "Pointy", "price": "9.99", "accessories": null, "image": "rock-river.png", "image_url": null}}, {"model": "rocks.rock", "pk": 6, "fields": {"name": "Flint", "description": "Flint is a rock with a rebellious streak. His rugged edges and rough texture make him stand out, and his independent nature means he's not one to follow rules. He thrives in creative, free-spirited environments where his edgy personality can flourish. He's not afraid to challenge the status quo, and his presence inspires those around him to think outside the box. Despite his tough exterior, Flint has a warm core, forming strong bonds with those who embrace his unique outlook on life.", "short_description": "Edgy and independent, Flint doesn't like to be told what to do. He's a rebel who thrives in a creative environment where rules are made to be broken. He's tough as nails but has a surprisingly warm core.", "user_notes": "", "is_owned": false, "owner": null, "material": "Flint", "texture": "Rough", "personality": "Independent, energetic, confident", "shape": "Pointy", "price": "13.99", "accessories": null, "image": "rock-flint.png", "image_url": null}}, {"model": "rocks.rock", "pk": 7, "fields": {"name": "Jimmy", "description": "Jimmy is the steadfast guardian you never knew you needed. His deep red hues exude a sense of warmth and strength, and his polished surface feels both comforting and protective. He's a loyal companion who thrives on routine and consistency. Jimmy is perfect for someone who values stability and dependability. While he's not flashy or demanding, he quietly ensures his presence is felt, always standing ready to provide emotional grounding during tough times.", "short_description": "Jimmy is a loyal and protective rock, perfect for someone who values consistency. He's the strong, silent type who always has your back. He prefers to stay close to home but loves being admired.", "user_notes": "", "is_owned": false, "owner": null, "material": "Jasper", "texture": "Smooth", "personality": "Loyal, friendly, resilient", "shape": "Rounded", "price": "15.99", "accessories": null, "image": "rock-jasper.png", "image_url": null}}, {"model": "rocks.rock", "pk": 8, "fields": {"name": "Marble", "description": "Marble is a daydreamer with a sophisticated edge. Her intricate veining is like a work of art, each line telling a unique story. She thrives in environments filled with creativity and refinement'think candlelit dinners, classical music, and poetry readings. Marble is not for everyone; her refined tastes can make her seem aloof, but those who connect with her will find a deeply artistic and thoughtful companion. She's happiest when she's in a space where her beauty and depth are truly appreciated.", "short_description": "Marble is an artsy dreamer with refined taste. She enjoys classical music, fine literature, and candlelit evenings. She'll fit best with someone who appreciates her sophistication.", "user_notes": "", "is_owned": false, "owner": null, "material": "Veined Marble", "texture": "Smooth", "personality": "Delicate, sophisticated, creative", "shape": "Rounded", "price": "13.99", "accessories": null, "image": "rock-marble.png", "image_url": null}}, {"model": "rocks.rock", "pk": 9, "fields": {"name": "Sprocket", "description": "Sprocket is a quirky little dynamo with a metallic sheen that mirrors his electric personality. Always full of ideas, he's the perfect match for a tinkerer or tech enthusiast. His shiny hematite surface has a magnetic charm, and his high-energy vibes make him an inspiring presence. Sprocket loves a fast-paced environment where he can be part of exciting projects. He's a bit eccentric, but for those who enjoy his lively nature, he's a one-of-a-kind companion.", "short_description": "Quirky and inventive, Sprocket has an unusual personality that some might find eccentric. He's perfect for a tinkerer or tech enthusiast. His metallic sheen complements his high-energy vibes.", "user_notes": "", "is_owned": false, "owner": null, "material": "Hematite", "texture": "Sharp", "personality": "Lively, eccentric, creative", "shape": "Rounded", "price": "14.99", "accessories": null, "image": "rock-hematite.png", "image_url": null}}, {"model": "rocks.rock", "pk": 10, "fields": {"name": "Dusty", "description": "Dusty is warm and gentle, like the desert at sunset. His soft, grainy texture is soothing to the touch, and he's happiest in cozy, intimate settings. Dusty doesn't need much'just a quiet corner where he can provide calm companionship. He loves being held, making him perfect for anyone who finds comfort in tactile experiences. He's a low-drama, low-maintenance rock who simply enjoys being part of your life.", "short_description": "Dusty is a gentle, warm rock who enjoys cozy settings. He loves being handled and is perfect for someone who likes tactile stimulation. He's not one for drama, preferring quiet companionship.", "user_notes": "", "is_owned": false, "owner": null, "material": "Sandstone", "texture": "Rough", "personality": "Warm, gentle, calm", "shape": "Rounded", "price": "10.99", "accessories": null, "image": "rock-sandstone.png", "image_url": null}}, {"model": "rocks.rock", "pk": 11, "fields": {"name": "Finn", "description": "Finn is a hardworking rock who values structure and routine. His matte slate surface gives him a no-nonsense appearance, but he's surprisingly adaptable. Finn thrives in environments where he feels useful, whether it's as a paperweight or a calming presence on your desk. He has a subtle charm that grows on you over time, and his dedication to his adopter is unwavering.", "short_description": "Finn is a no-nonsense rock with a work ethic that can't be beat. He thrives in structured environments and loves being part of a routine. He's happiest when he feels useful.", "user_notes": "", "is_owned": false, "owner": null, "material": "Slate", "texture": "Sharp", "personality": "Loyal, hardworking, straightforward", "shape": "Uneven", "price": "11.99", "accessories": null, "image": "rock-slate.png", "image_url": null}}, {"model": "rocks.rock", "pk": 12, "fields": {"name": "Opal", "description": "Opal is a dreamy, magical presence who seems to glow from within. Her colors shift and change with the light, reflecting her ever-evolving personality. One moment she's serene and contemplative, the next she's playful and mischievous. Opal thrives in spaces where her beauty can be admired, especially by those who value creativity and a little unpredictability. She's a muse for artists and dreamers alike, bringing inspiration to those lucky enough to adopt her.", "short_description": "Opal is a dreamy, whimsical rock with an ever-changing personality. Her colors shift in the light, reflecting her mood. She's perfect for someone who appreciates beauty and unpredictability.", "user_notes": "", "is_owned": false, "owner": null, "material": "Iridescent Opal", "texture": "Smooth", "personality": "Moody, dreamy, whimsical", "shape": "Rounded", "price": "18.99", "accessories": null, "image": "rock-opal.png", "image_url": null}}, {"model": "rocks.rock", "pk": 13, "fields": {"name": "Violet", "description": "Violet is a rock of mystery and magic, her deep violet surface shimmering with an otherworldly allure. She's intuitive and introspective, making her the perfect companion for those who love to explore life's deeper meanings. Violet thrives in serene, meditative environments, where her presence inspires contemplation and creativity. She has an uncanny ability to calm the mind and soothe the soul, creating a haven of tranquility for her adopter. With her regal hue and sparkling facets, she's as much a queen as she is a mystic, embodying both beauty and wisdom. Violet bonds deeply with those who appreciate her thoughtful nature, rewarding her adopter with an endless well of inspiration and a profound sense of calm.", "short_description": "Violet is a dreamy, spiritual rock with a regal violet hue. She's intuitive and wise, always bringing a sense of peace and wonder to her surroundings. Ideal for someone who values reflection and connection to the mystical.", "user_notes": "", "is_owned": false, "owner": null, "material": "Amethyst", "texture": "Sharp", "personality": "Intuitive, introspective, calm", "shape": "Rounded", "price": "16.99", "accessories": null, "image": "rock-amethyst.png", "image_url": null}}, {"model": "rocks.rock", "pk": 14, "fields": {"name": "Milo", "description": "Milo is the cornerstone of the rock world, embodying resilience and reliability with his sturdy granite build. He is unpretentious and warm, a rock who doesn't demand much but gives everything in return. Milo makes for a steadfast companion who thrives in homes where life is always bustling, whether it's a family with kids, a busy professional, or someone who just needs a grounding presence. He loves being part of the action, sitting proudly on a windowsill or in a garden where he can weather the elements without a fuss. Reliable, loyal, and always ready to support you, Milo is the rock equivalent of a best friend.", "short_description": "Milo is a dependable and unshakable rock with a soft, speckled charm. He's the ultimate steady companion, thriving in active households and standing strong in all seasons of life. Milo is the rock you can count on - always.", "user_notes": "", "is_owned": false, "owner": null, "material": "Granite", "texture": "Rough", "personality": "Dependable, resilient, friendly", "shape": "Rounded", "price": "10.99", "accessories": null, "image": "rock-granite.png", "image_url": null}}]